# Дана строка. Найдите первый неповторяющийся символ в этой строке и верните его индекс. Если такого элемента нет, то верните -1 (минус один).
s = input()
print(s)

for c in range(s):
    print(c)