# Дана строка. Найдите в ней все глассные и разверни их в обратную строну.
word = input()
print(word)
