#Напишите программу, которая находит самый длинный общий префикс для строк находящихся в списке строк
s = input().split(',')
print(s)
