#Дан массив чисел. Если в нем есть дубликаты, то верните True, если нет, то False.

nums = [int(i) for i in  input().split(',')]
print(nums)